dannyf00/Ghetto-GPSDO/dspic33duino.h
#ifndef _dsPIC33DUINO_H
#define _dsPIC33DUINO_H

//dsPIC33duino code
// - supported chips: dspic33fj32GP302/304, dspic33fj64gp202/204/802/804, dspic33fj128gp202/204/802/804
// -   note: should work with other chips in the same family, like PIC24H
// - free running timer2 for ticks, pwm and input capture
// - details: https://github.com/dannyf00/Minimalist-16-bit-Arduino-Clone
// - only XC16 support is provided
//
// - version history
// - v0.1, 12/29/2022: initial porting from pic24duino (FRC@7.3728Mhz!)
// - v0.2, 01/08/2023: added support for PLL
// - v0.2a,01/14/2023: added support for DAC1
// - v0.2c,01/29/2023: fixed pll bugs
// - v0.2d,06/03/2023: implemented circular buffer for uart transmission
//
//
//               dsPIC33FJ
//              |=====================|
//    Vcc       |                     |
//     |        |                Vcap |>--[.1u]-+->GND
//     |        |                     |         |
//     +-[10K]-<| MCLR        DISVreg |>--------+
//              |                     |
//              |                     |
//     +------->| OSCI            Vdd |>--+------->Vcc
//  [Xtal]      |                     | [.1u]
//     +-------<| OSCO            Vss |>--+------->GND
//              |                     |
//              |                 RB0 |>---------->Uart2TX
//              |                     |
//              |                 RB5 |>---------->LED
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |=====================|
//
//

#if defined(__XC16__)
#include <xc.h>								//we use xc16
#elif defined(__C30__)
#include <p33fxxxx.h>
#else
#error "dsPIC33duino.h: only XC16 & C30 compiler supported"
#endif
#include <stdint.h>							//should uncomment below//define my own uint types
#include <string.h>							//we use strcpy()
#include <time.h>							//we use time

//hardware configuration
//#define USE_MAIN							//use self-defined main() in user code
//#define USE_CORETICK						//for compatability with pic32duino. ignored
#define SYSTICK_TMR1						//systick running on tmr1 if defined (default). otherwise on tmr2

//oscillator configuration
#define F_XTAL				10000000ul		//crystal frequency, user-specified
#define F_SOSC				32768			//SOSC = 32768Hz, user-specified
#define F_sI2C				100000ul		//frquency for software i2c
#define uRAM_SIZE			40				//uart transmission buffer size
//#define UART1_TXISR						//uncomment if polling transmission is used for uart1. Otherwise, uart1 transmission via interrupt
#define UART2_TXISR							//uncomment if polling transmission is used for uart1. Otherwise, uart2 transmission via interrupt
//configuration for circular buffer
/*******NOTE*************/
/******cBUFF_SIZE********/
/***must be power of 2***/
/************************/
#define cBUFF_SIZE 			256				//must be power of 2, 0..256 -> for longer buffers, change data type for writeIndex/readIndex
typedef char cbuffer_t;						//storage unit for the buffer
//end configuration for circular buffer

#define TxIP_DEFAULT		5				//default priority for timer interrupts 0..7. 0->interrupt disabled, 7->highest priority
#define UxIP_DEFAULT		3				//default priority for uart interrupts 0..7. 0->interrupt disabled, 7->highest priority
#define TxIS_DEFAULT		5				//default subpriority for timer interrupts
#define OCxIP_DEFAULT		5				//default priority for timer interrupts 0..7. 0->interrupt disabled, 7->highest priority
#define CRCIP_DEFAULT		5				//default priority for crc interrupt
#define SPIIP_DEFAULT		1				//default interrupt priority
#define SPIIS_DEFAULT		1
#define RTCIP_DEFAULT		1
//end user specification

//uart1 pin configuration
#define U1TX2RP()			PPS_U1TX_TO_RP(0)			//map u1tx pin to an rp pin
//#define U1RX2RP()			PPS_U1RX_TO_RP(1)			//map u1rx pin to an rp pin

//uart2 pin configuration
#define U2TX2RP()			PPS_U2TX_TO_RP(0)			//u2tx pin
//#define U2RX2RP()			PPS_U2RX_TO_RP(1)			//u2rx pin

//pwm/oc pin configuration
//#define PWM12RP()			PPS_OC1_TO_RP(5)			//oc1 pin:
#define PWM22RP()			PPS_OC2_TO_RP(5)			//oc2 pin:
#define PWM32RP()			PPS_OC3_TO_RP(6)			//oc3 pin:
#define PWM42RP()			PPS_OC4_TO_RP(6)			//oc4 pin:
#define PWM52RP()			PPS_OC5_TO_RP(6)			//oc5 pin:
#define PWM62RP()			PPS_OC6_TO_RP(6)			//oc6 pin:
#define PWM72RP()			PPS_OC7_TO_RP(6)			//oc7 pin:
#define PWM82RP()			PPS_OC8_TO_RP(6)			//oc8 pin:

//timer input pin configure: default input=F_PHB
//#define T1CK2RP()										//t1ck pin: not remappable
//#define T2CK2RP()			PPS_T2CK_TO_RP(6)			//t2ck pin:
//#define T3CK2RP()			PPS_T3CK_TO_RP(6)			//t3ck pin:
//#define T4CK2RP()			PPS_T4CK_TO_RP(6)			//t4ck pin:
//#define T5CK2RP()			PPS_T5CK_TO_RP(6)			//t5ck pin:

//input capture pin configuration
#define IC12RP()			PPS_IC1_TO_RP(4)			//ic1 pin:
#define IC22RP()			PPS_IC2_TO_RP(7)			//ic2 pin:
#define IC32RP()			PPS_IC3_TO_RP(4)			//ic3 pin:
#define IC42RP()			PPS_IC4_TO_RP(4)			//ic4 pin:
#define IC52RP()			PPS_IC5_TO_RP(4)			//ic5 pin:
#define IC62RP()			PPS_IC6_TO_RP(4)			//ic6 pin:
#define IC72RP()			PPS_IC7_TO_RP(4)			//ic7 pin:
#define IC82RP()			PPS_IC8_TO_RP(4)			//ic8 pin:

//spi1 pin configuration
#define SCK1RP()			PPS_SCK1OUT_TO_RP(0)		//spi1 serial clock output
#define SDO1RP()			PPS_SDO1_TO_RP(1)			//spi1 serial data output
//#define SDI1RP()			PPS_SDI1_TO_RP(3)			//spi1 serial data input
#define SCK2RP()			PPS_SCK2OUT_TO_RP(1)		//spi1 serial clock output
#define SDO2RP()			PPS_SDO2_TO_RP(2)			//spi1 serial data output
#define SDI2RP()			PPS_SDI2_TO_RP(3)			//spi1 serial data input

//extint pin configuration
//#define INT02RP()			PPS_INT0_TO_RP(7)			//int0 pin: fixed to rp7
#define INT12RP()			PPS_INT1_TO_RP(5)			//int1 pin:
#define INT22RP()			PPS_INT2_TO_RP(5)			//int2 pin:
#define INT32RP()			PPS_INT3_TO_RP(5)			//int3 pin:
#define INT42RP()			PPS_INT4_TO_RP(5)			//int4 pin:

