dannyf00/Ghetto-GPSDO/dspic33duino.h
//i2c
//end i2c

//software i2c
#define sI2CSCLPIN			PB2
#define sI2CSDAPIN			PB1
//end software i2c

//end pin configuration

#define PWM_PR				0xffff			//pwm period - don't change

//operate on a var
#define REG_SET(var, bits)				var |= (bits)
#define REG_CLR(var, bits)				var &=~(bits)
#define REG_FLP(var, bits)				var ^= (bits)
#define REG_GET(var, bits)				((var) & (bits))
#define REG_MOD(var, bits, mask)		(var = ((var) &~(mask)) | ((bits) & (mask)))

//port manipulation macros for PIC.
#define IO_SET(port, bits)				REG_SET(port->LAT, bits)	//port |= (bits)			//set bits on port
#define IO_CLR(port, bits)				REG_CLR(port->LAT, bits)	//port &=~(bits)			//clear bits on port
#define IO_FLP(port, bits)				REG_FLP(port->LAT, bits)	//port ^= (bits)			//flip bits on port
#define IO_GET(port, bits)				REG_GET(port->PORT, bits)	//((port) & (bits))		//return bits on port
#define IO_OUT(port, bits)				REG_CLR(port->TRIS, bits)	//ddr &=~(bits)			//set bits as output
#define IO_IN(port, bits)				REG_SET(port->TRIS, bits)	//ddr |= (bits)			//set bits as input

//if gpio_typedef is used
#define GIO_SET(port, bits)				IO_SET(port, bits)			//set bits on port
#define GIO_CLR(port, bits)				IO_CLR(port, bits)			//clear bits on port
#define GIO_FLP(port, bits)				IO_FLP(port, bits)			//flip bits on port
#define GIO_GET(port, bits)				IO_GET(port, bits)			//return bits on port
#define GIO_OUT(port, bits)				IO_OUT(port, bits)			//set bits as output
#define GIO_IN(port, bits)				IO_IN(port,  bits)			//set bits as input

//fast port operations
#define FIO_SET(port, bits)				IO_SET(port, bits)			//port->LATSET = (bits)			//set bits on port
#define FIO_CLR(port, bits)				IO_CLR(port, bits)			//port->LATCLR = (bits)			//clear bits on port
#define FIO_FLP(port, bits)				IO_FLP(port, bits)			//port->LATINV = (bits)			//flip bits on port
#define FIO_GET(port, bits)				IO_GET(port, bits)			//((port->PORT) & (bits))		//return bits on port
#define FIO_OUT(port, bits)				IO_OUT(port, bits)			//port->TRISCLR = (bits)			//set bits as output
#define FIO_IN(port,  bits)				IO_IN(port,  bits)			//port->TRISSET = (bits)			//set bits as input

//tiny scheduler macro
#define TS_RUN_WHILE(cs)	if (cs)						//tiny scheduler macro
#define tsWhile(cs)			TS_RUN_WHILE(cs)			//shorter notation

#define NOP()				Nop()						   //asm("nop")					//nop()
#define NOP2()				{NOP(); NOP();}
#define NOP4()				{NOP2(); NOP2();}
#define NOP8()				{NOP4(); NOP4();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP24()				{NOP16(); NOP8();}
#define NOP32()				{NOP16(); NOP16();}
#define NOP40()				{NOP32(); NOP8();}
#define NOP64()				{NOP32(); NOP32();}

#define sleep()				asm("sleep")						//put the mcu into sleep

#ifndef ei
#define ei()				__builtin_disi(0x0000)				//asm volatile ("ei")				//__builtin_enable_interrupts()	//do {INTEnableInterrupts();	INTEnableSystemMultiVectoredInt();} while (0)	//__builtin_enable_interrupts()
#endif

#ifndef di
#define di()				__builtin_disi(0x3fff)			//asm volatile ("di")				//__builtin_enable_interrupts()	//INTDisableInterrupts()			//__builtin_disable_interrupts()	//
#endif

#define F_PHB				(SystemCoreClock / 2)			//cpu runs at F_SYS/2 by default -> Fxtal = 8Mhz. *4 for PLL. RCDIV set to 0 (1:1 postscaler)
#define F_CPU				(CLKDIVbits.DOZEN?(F_PHB >> CLKDIVbits.DOZE):(F_PHB))			//peripheral block runs at F_PHB - default = F_CPU / 1
#define F_FRC				7372800ul						//7359420ul	//7372800ul						//FRC frequency = 7.3728Mhz, nominal. +/- 2% accuracy per datasheet. Measured to be 7359420: 7359280 - 640Hz for this particular mcu by measuring uart at 9600bps
#define F_LPRC				32768							//LPRC = 32.768Khz, fixed
extern uint32_t SystemCoreClock;							//pheriphral core clock, before dividing by 2
#define FRCTRIM				(+0)							//+/-64. chip specific. ~8Khz/increment. +->speed up, -->slow down
#define FRCSetTrim(trim)	OSCTUNbits.TUN = (trim)			//OSCTUN = (trim)					//+/- 64
#define FRCGetTrim()		(OSCTUNbits.TUN)				//(OSCTUN & 0x3f)

//iolock/unlock sequence
//unlock IOLOCK
#define IO_UNLOCK()	{asm volatile ( "MOV #OSCCON, w1 \n" \
					"MOV #0x46, w2 \n" \
					"MOV #0x57, w3 \n" \
					"MOV.b w2, [w1] \n" \
					"MOV.b w3, [w1] \n" \
					"BCLR OSCCON,#6"); \
					}

//lock IOLOCK
#define IO_LOCK()	{asm volatile ( "MOV #OSCCON, w1 \n" \
					"MOV #0x46, w2 \n" \
					"MOV #0x57, w3 \n" \
					"MOV.b w2, [w1] \n" \
					"MOV.b w3, [w1] \n" \
					"BSET OSCCON, #6" ); \
					}

//pps macros
//more on macro
//macros for remappable pins
//for peripheral pin select (PPS)
#if defined(_INT1R)
/// Maps INT1 to a remappable pin;
/// see PPS_xxx_TO_RP(pin) for more informatino.
#define PPS_INT1_TO_RP(pin) _INT1R = pin
#else
#define PPS_INT1_TO_RP(pin)
#endif


#if defined(_INT2R)
#define PPS_INT2_TO_RP(pin) _INT2R = pin
#else
#define PPS_INT2_TO_RP(pin)
#endif

#if defined(_T2CKR)
#define PPS_T2CK_TO_RP(pin) _T2CKR = pin
#else
#define PPS_T2CK_TO_RP(pin)
#endif

#if defined(_T3CKR)
#define PPS_T3CK_TO_RP(pin) _T3CKR = pin
#else
#define PPS_T3CK_TO_RP(pin)
#endif

#if defined(_T4CKR)
#define PPS_T4CK_TO_RP(pin) _T4CKR = pin
#else
#define PPS_T4CK_TO_RP(pin)
#endif

#if defined(_T5CKR)
#define PPS_T5CK_TO_RP(pin) _T5CKR = pin
#else
#define PPS_T5CK_TO_RP(pin)
#endif

#if defined(_IC1R)
#define PPS_IC1_TO_RP(pin) _IC1R = pin
#else
#define PPS_IC1_TO_RP(pin)
#endif

#if defined(_IC2R)
#define PPS_IC2_TO_RP(pin) _IC2R = pin
#else
#define PPS_IC2_TO_RP(pin)
#endif

#if defined(_IC3R)
#define PPS_IC3_TO_RP(pin) _IC3R = pin
#else
#define PPS_IC3_TO_RP(pin)
#endif

#if defined(_IC4R)
#define PPS_IC4_TO_RP(pin) _IC4R = pin
#else
#define PPS_IC4_TO_RP(pin)
#endif

#if defined(_IC5R)
#define PPS_IC5_TO_RP(pin) _IC5R = pin
#else
#define PPS_IC5_TO_RP(pin)
#endif

#if defined(_IC6R)
#define PPS_IC6_TO_RP(pin) _IC6R = pin
#else
#define PPS_IC6_TO_RP(pin)
#endif

#if defined(_IC7R)
#define PPS_IC7_TO_RP(pin) _IC7R = pin
#else
#define PPS_IC7_TO_RP(pin)
#endif

#if defined(_IC8R)
#define PPS_IC8_TO_RP(pin) _IC8R = pin
#else
#define PPS_IC8_TO_RP(pin)
#endif

#if defined(_OCFAR)
#define PPS_OCFA_TO_RP(pin) _OCFAR = pin
#else
#define PPS_OCFA_TO_RP(pin)
#endif

