dannyf00/Ghetto-GPSDO/dspic33duino.h
//pwm output
//dc = 0x00..0x0fff for pwm2/3/4/5, 0x00..0xffff for pwm1
//RP4=PWM1, RP12=PWM2, RP13=PWM3, RP14=PWM4, RP15=PWM5
void analogWrite(uint8_t pin, uint16_t dc);

//analog read on ADC1
//read DRL first for right aligned results
//uint16_t analogRead(uint8_t pin);

//analog reference - default to AVdd-AVss
//Vref sources: 0->Vref = AVdd-AVss, 1->Vref+-AVss, 2->AVdd-Vref-, 3->Vref+ - Vref-
//void analogReference(uint8_t Vref);

//interrupts
//install external interrupt handler
//mode 1: falling edge, 0: rising edge
//void attachInterrupt(uint8_t intx, void (*isrptr) (void), uint8_t mode);
//void detachInterrupt(uint8_t intx);

//change notification interrupts
//install user CN interrupt handler
//void attachCNInterrupt(void (*isrptr) (void));
//void detachCNInterrupt(void);
//void activateCNInterrupt(uint8_t cnx, uint8_t pue);
//void deactivateCNInterrupt(uint8_t cnx);

//global variables

//reset the mcu
void mcuInit(void);
//111 = Fast RC Oscillator with Postscaler (FRCDIV)
//110 = Reserved
//101 = Low-Power RC Oscillator (LPRC)
//100 = Secondary Oscillator (SOSC)
//011 = Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
//010 = Primary Oscillator (XT, HS, EC)
//001 = Fast RC Oscillator with Postscaler and PLL module (FRCPLL)
//000 = Fast RC Oscillator (FRC)
//Needs to be executed during mcu initialization or after oscillator reconfiguration
//updates SystemCoreClock.
uint32_t SystemCoreClockUpdate(void);

//switch oscillator
//return SystemCoreClock in frequency
//111 = Fast RC Oscillator with Postscaler (FRCDIV)
//110 = Reserved
//101 = Low-Power RC Oscillator (LPRC)
//100 = Secondary Oscillator (SOSC)
//011 = Primary Oscillator with PLL module (XTPLL, HSPLL, ECPLL)
//010 = Primary Oscillator (XT, HS, EC)
//001 = Fast RC Oscillator with Postscaler and PLL module (FRCPLL)
//000 = Fast RC Oscillator (FRC)
//Needs to be executed during mcu initialization or after oscillator reconfiguration
//updates SystemCoreClock.
uint32_t SystemCoreClockSwitch(uint8_t nosc);

//pll - for dspic33
//set up pll multipliers
//Fout=Fin / N1 * M / N2
//N1: 0 (2:1), 1 (3:1), 2 (4:1), ..., 31 (33:1)
//M : 0 (2x ), 1 (3x ), 2 (4x ), ..., 511 (513x)
//N2: 0 (2:1), 1 (4:1), 2 (6:1), 3 (8:1). DS says 2 is reserved
void pllSet(uint32_t N1, uint32_t M, uint32_t N2);
//read pll multiplier
//Fout=Fin / N1 * M / N2
uint32_t pllGet(uint32_t Fin);
//may need adjustments to satisfy PLL operating conditions
//Fin: 0.8 - 8Mhz
//Fpll:100 - 200Mhz
//Fout: < 80Mhz
//not all multipliers below are valid
//need to check for specific applications
#define pll0x1()	pllSet(3, 4   -2, 3)		//=1/5*4/8
#define pllx125()	pllSet(2, 4   -2, 3)		//=1/4*4/8
#define pll0x2()	pllSet(3, 8   -2, 3)		//=1/5*8/8
#define pllx25()	pllSet(2, 8   -2, 3)		//=1/4*8/8
#define pll0x4()	pllSet(3, 16  -2, 3)		//=1/5*16/8
#define pll0x5()	pllSet(2, 16  -2, 3)		//=1/4*16/8
#define pll0x8()	pllSet(3, 16  -2, 1)		//=1/5*16/4
#define pll1x()		pllSet(2, 32  -2, 3)		//=1/4*32/8
#define pll1x2()	pllSet(3, 48  -2, 3)		//=1/5*48/8
#define pll1x5()	pllSet(2, 48  -2, 3)		//=1/4*48/8
#define pll1x6()	pllSet(3, 32  -2, 1)		//=1/5*32/4
#define pll2x()		pllSet(0, 32  -2, 3)		//=1/2*32/8
#define pll2x5()	pllSet(0, 24  -2, 3)		//=1/2*24/8
#define pll3x()		pllSet(0, 13 -2,  0)		//=1/2*12/2
#define pll3x5()	pllSet(0, 14 -2,  0)		//=1/2*14/2
#define pll4x()		pllSet(0, 16 -2,  0)		//=1/2*16/2
#define pll4x5()	pllSet(0, 18 -2,  0)		//=1/2*18/2
#define pll5x()		pllSet(0, 20 -2,  0)
#define pll5x5()	pllSet(0, 22 -2,  0)		//4*5.5-2
#define pll6x()		pllSet(0, 46 -2,  0)
#define pll6x5()	pllSet(0, 26 -2,  0)		//4*6.5-2
#define pll7x()		pllSet(0, 28 -2,  0)
#define pll7x5()	pllSet(0, 30 -2,  0)		//4*7.5-2
#define pll8x()		pllSet(0, 32 -2,  0)
#define pll8x5()	pllSet(0, 34 -2,  0)		//4*8.5-2
#define pll9x()		pllSet(0, 36 -2,  0)
#define pll9x5()	pllSet(0, 38 -2,  0)		//4*9.5-2
#define pll10x()	pllSet(0, 4*10-2, 0)
#define pll11x()	pllSet(0, 4*11-2, 0)
#define pll12x()	pllSet(0, 4*12-2, 0)
#define pll14x()	pllSet(0, 4*14-2, 0)
#define pll15x()	pllSet(0, 4*15-2, 0)
#define pll16x()	pllSet(0, 4*16-2, 0)
#define pll18x()	pllSet(0, 4*18-2, 0)
#define pll20x()	pllSet(0, 4*20-2, 0)
#define pll24x()	pllSet(0, 4*24-2, 0)
#define pll25x()	pllSet(0, 4*25-2, 0)
#define pll30x()	pllSet(0, 4*30-2, 0)
#define pll32x()	pllSet(0, 4*32-2, 0)
#define pll35x()	pllSet(0, 4*35-2, 0)
#define pll36x()	pllSet(0, 4*36-2, 0)
#define pll40x()	pllSet(0, 4*40-2, 0)
#define pll45x()	pllSet(0, 4*45-2, 0)
#define pll48x()	pllSet(0, 4*48-2, 0)
#define pll50x()	pllSet(0, 4*50-2, 0)
#define pll55x()	pllSet(0, 4*55-2, 0)
#define pll64x()	pllSet(0, 4*64-2, 0)
#define pll65x()	pllSet(0, 4*65-2, 0)
#define pll96x()	pllSet(0, 4*96-2, 0)	//max multiplier is 533 > 4*96
#define pllWait()	while (OSCCONbits.LOCK == 0) continue			//1->pll in lock, 0->pll not locked
#define SystemCoreClockFRC()			SystemCoreClockSwitch(0b000)
#define SystemCoreClockFRCPLL()			SystemCoreClockFRCPLL4x()
#define SystemCoreClockFRCPLL0x1()		do {pll0x1();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLLx125()		do {pllx125();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL0x2()		do {pll0x2();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLLx25()		do {pllx25();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL0x4()		do {pll0x4();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL0x5()		do {pll0x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL0x8()		do {pll0x8();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL1x()		do {pll1x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL1x5()		do {pll1x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL1x6()		do {pll1x6();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL2x()		do {pll2x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL2x5()		do {pll2x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL3x()		do {pll3x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL3x5()		do {pll3x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL4x()		do {pll4x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL4x5()		do {pll4x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL5x()		do {pll5x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL5x5()		do {pll5x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL6x()		do {pll6x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL6x5()		do {pll6x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL7x()		do {pll7x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL7x5()		do {pll7x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL8x()		do {pll8x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL8x5()		do {pll8x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL9x()		do {pll9x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL9x5()		do {pll9x5();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL10x()		do {pll10x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL11x()		do {pll11x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL12x()		do {pll12x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL14x()		do {pll14x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL15x()		do {pll15x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockFRCPLL16x()		do {pll16x();SystemCoreClockSwitch(0b001); pllWait();} while (0)
//#define SystemCoreClockFRCPLL18x()		do {pll18x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
//#define SystemCoreClockFRCPLL20x()		do {pll20x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
//#define SystemCoreClockFRCPLL24x()		do {pll24x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
//#define SystemCoreClockFRCPLL32x()		do {pll32x(); SystemCoreClockSwitch(0b001); pllWait();} while (0)
#define SystemCoreClockPOSC()			SystemCoreClockSwitch(0b010)
#define SystemCoreClockPOSCPLL()		SystemCoreClockPOSCPLL4x()
#define SystemCoreClockPOSCPLL0x1()		do {pll0x1();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLLx125()	do {pllx125();SystemCoreClockSwitch(0b011);pllWait();} while (0)
#define SystemCoreClockPOSCPLL0x2()		do {pll0x2();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLLx25()		do {pllx25();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL0x4()		do {pll0x4();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL0x5()		do {pll0x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL0x8()		do {pll0x8();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL1x()		do {pll1x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL1x5()		do {pll1x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL1x6()		do {pll1x6();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL2x()		do {pll2x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL2x5()		do {pll2x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL3x()		do {pll3x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL3x5()		do {pll3x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL4x()		do {pll4x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL4x5()		do {pll4x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL5x()		do {pll5x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL5x5()		do {pll5x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL6x()		do {pll6x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL6x5()		do {pll6x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL7x()		do {pll7x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL7x5()		do {pll7x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL8x()		do {pll8x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL8x5()		do {pll8x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL9x()		do {pll9x(); SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL9x5()		do {pll9x5();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL10x()		do {pll10x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL11x()		do {pll11x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL12x()		do {pll12x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL14x()		do {pll14x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL15x()		do {pll15x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL16x()		do {pll16x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL18x()		do {pll18x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL20x()		do {pll20x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL24x()		do {pll24x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL25x()		do {pll25x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockPOSCPLL32x()		do {pll32x();SystemCoreClockSwitch(0b011); pllWait();} while (0)
#define SystemCoreClockSOSC()			SystemCoreClockSwitch(0b100)
#define SystemCoreClockLPRC()			SystemCoreClockSwitch(0b101)
#define SystemCoreClockFRCDIV()			SystemCoreClockSwitch(0b111)

//empty interrupt handler
void empty_handler(void);


//#define Mhz					000000ul	//suffix for Mhz
#define F_UART				(F_PHB)	//peripheral clock
#define UART_BR300			300ul		//buadrate=300
#define UART_BR600			600ul		//buadrate=600
#define UART_BR1200			1200ul		//buadrate=1200
#define UART_BR2400			2400ul		//buadrate=2400
#define UART_BR4800			4800ul		//buadrate=4800
#define UART_BR9600			9600ul		//buadrate=9600
#define UART_BR14400		14400ul		//buadrate=19200
#define UART_BR19200		19200ul		//buadrate=19200
#define UART_BR38400		38400ul		//buadrate=38400
#define UART_BR43000		43000ul		//buadrate=38400
#define UART_BR57600		57600ul		//buadrate=57600
#define UART_BR76800		76800ul		//buadrate=57600
#define UART_BR115200		115200ul	//buadrate=115200
#define UART_BR128000		128000ul	//buadrate=115200
#define UART_BR230400		230400ul	//buadrate=115200
#define UART_BR256000		256000ul	//buadrate=115200
#define UART_BR460800		460800ul	//buadrate=115200
#define UART_BR512000		512000ul	//buadrate=115200
#define UART_BR576000		576000ul	//buadrate=115200
#define UART_BR921600		921600ul	//buadrate=115200
#define UART_BR1000000		1000000ul	//buadrate=115200
#define UART_BR1250000		1250000ul	//buadrate=115200
#define UART_BR1500000		1500000ul	//buadrate=115200
#define UART_BR2000000		2000000ul	//buadrate=115200
//short notations
#define UART_BR0K3			UART_BR300
#define UART_BR0K6			UART_BR600
#define UART_BR1K2			UART_BR1200
#define UART_BR2K4			UART_BR2400
#define UART_BR4K8			UART_BR4800
#define UART_BR9K6			UART_BR9600
#define UART_BR14K4			UART_BR14400
#define UART_BR19K2			UART_BR19200
#define UART_BR38K4			UART_BR38400
#define UART_BR43K			UART_BR43000
#define UART_BR57K6			UART_BR57600
#define UART_BR76K8			UART_BR76800
#define UART_BR115K2		UART_BR115200
#define UART_BR128K			UART_BR128000
#define UART_BR256K			UART_BR256000
#define UART_BR460K8		UART_BR460800
#define UART_BR512K			UART_BR512000
#define UART_BR576K			UART_BR576000
#define UART_BR1M			UART_BR1000000
#define UART_BR1M25			UART_BR1250000
#define UART_BR1M5			UART_BR1500000
#define UART_BR2M			UART_BR2000000

