dannyf00/Ghetto-GPSDO/dspic33duino.h
//uart structure
typedef struct {
	volatile uint16_t MODE;			//mode register
	volatile uint16_t STA;			//status register
	volatile uint16_t TXREG;		//transmission data register
	volatile uint16_t RXREG;		//receiving data register
	volatile uint16_t BRG;			//baud rate register
} UART_TypeDef;						//port definition registers

#define UART1				((UART_TypeDef *) &U1MODE)
#define UART2				((UART_TypeDef *) &U2MODE)

//initiate the hardware usart1
void uart1Init(unsigned long baud_rate);//initialize uart
//void uart1Putch(char ch);				//output a char on uart
#define uart1Putch(ch)		do {uart1Wait(); U1TXREG=(ch);} while (0)	//void uart1Putch(char ch);					//send a char
void uart1Puts(char *str);				//output a string on uart
//void uart1Putline(char *ln);			//output a string + linefeed on uart
#define uart1Putline(str)	do {uart1Puts(str); uart1Puts("\r\n");} while (0)
#define uart1Getch()		U1RXREG		//uint8_t uart1Getch(void);				//read a char from usart
#define uart1Available()	(U1STAbits.URXDA)	//uint16_t uart1Available(void);			//test if data rx is available
#if defined(UART1_TXISR)
#define uart1Busy()			(IEC0bits.U1TXIE)	//(!U1STAbits.TRMT)	//
#else
#define uart1Busy()			(U1STAbits.UTXBF)
#endif
#define uart1Wait()			while (uart1Busy()) continue
void u1Print(char *str, int32_t dat);	//output a number on uart
#define u1Println()			uart1Puts("\r\n")
//for compatability
#define uart1Put(ch)		uart1Putch(ch)
#define uart1Get()			uart1Getch()
#define uart1bps()			((U1MODEbits.BRGH==1)?(F_UART / 4 / (U1BRG+1)):(F_UART / 16 / (U1BRG+1)))
#define u1bps()				uart1bps()

//initiate the hardware usart2
void uart2Init(unsigned long baud_rate);//initialize uart
//void uart2Putch(char ch);				//output a char on uart
#define uart2Putch(ch)		do {uart2Wait(); U2TXREG=(ch);} while (0)
#define uart2Putc(ch)		uart2Putch(ch)
void uart2Puts(char *str);				//output a string on uart
//void uart2Putline(char *ln);			//output a string + linefeed on uart
#define uart2Putline(str)	do {uart2Puts(str); uart2Puts("\r\n");} while (0)
#define uart2Getch()		U2RXREG		//uint8_t uart2Getch(void);				//read a char from usart
#define uart2Available()	(U2STAbits.URXDA)	//uint16_t uart2Available(void);			//test if data rx is available
#if defined(UART2_TXISR)
#define uart2Busy()			(IEC1bits.U2TXIE)
#else
#define uart2Busy()			(U2STAbits.UTXBF)	//uint16_t uart2Busy(void);				//test if uart tx is busy
#endif
#define uart2Wait()			while (uart2Busy()) continue
void u2Print(char *str, int32_t dat);	//output a number on uart
#define u2Println()			uart2Puts("\r\n")
//for compatability
#define uart2Put(ch)		uart2Putch(ch)
#define uart2Get()			uart2Getch()
#define uart2bps()			((U2MODEbits.BRGH==1)?(F_UART / 4 / (U2BRG+1)):(F_UART / 16 / (U2BRG+1)))
#define u2bps()				uart2bps()
//end Serial


//tmr1-5 prescaler
#define TMR_PS1x			0x00
//#define TMR_PS4x			0x01
#define TMR_PS8x			0x01
#define TMR_PS64x			0x02
#define TMR_PS256x			0x03
#define TMR_PSMASK			TMR_PS256x

//timer structure
typedef struct {
	volatile uint16_t CON;			//timer control register
	volatile uint16_t PR;			//period register
	volatile uint16_t TMR;			//timer counter register
} TIM_TypeDef;						//timer definition registers

#define TIM1				((TIM_TypeDef *) &TMR1)
#define TIM2				((TIM_TypeDef *) &TMR2)
#define TIM3				((TIM_TypeDef *) &TMR3)
#define TIM4				((TIM_TypeDef *) &TMR4)
#define TIM5				((TIM_TypeDef *) &TMR5)

//#define TMR_IPDEFAULT		2
//#define TMR_ISDEFAULT		0

//initialize the timer1 (16bit)
void tmrInit(TIM_TypeDef *TIMx, uint8_t ps);	//generic timer reset routine
void tmr1Init(uint8_t ps);
#define tmr1SetPS(ps)			T1CONbits.TCKPS = (ps)
#define tmr1GetPS()				((T1CONbits.TCKPS == 0)?1:((T1CONbits.TCKPS == 1)?8:((T1CONbits.TCKPS == 2)?64:256)))
#define tmr1SetPR(pr)			do {PR1 = (pr) - 1;} while (0)
#define tmr1GetPR()				(PR1 + 1l)
#define tmr1Get()				(TMR1)
//activate the isr handler
void tmr1AttachISR(void (*isrptr)(void));

//initialize the timer2 (16bit)
void tmr2Init(uint8_t ps);
#define tmr2SetPS(ps)			T2CONbits.TCKPS = (ps)
#define tmr2GetPS()				((T2CONbits.TCKPS == 0)?1:((T2CONbits.TCKPS == 1)?8:((T2CONbits.TCKPS == 2)?64:256)))
#define tmr2SetPR(pr)			do {PR2 = (pr) - 1;} while (0)
#define tmr2GetPR()				(PR2 + 1l)
#define tmr2Get()				(TMR2)
//activate the isr handler
void tmr2AttachISR(void (*isrptr)(void));

//initialize the timer3 (16bit)
void tmr3Init(uint8_t ps);
#define tmr3SetPS(ps)			T3CONbits.TCKPS = (ps)
#define tmr3GetPS()				((T3CONbits.TCKPS == 0)?1:((T3CONbits.TCKPS == 1)?8:((T3CONbits.TCKPS == 2)?64:256)))
#define tmr3SetPR(pr)			do {PR3 = (pr) - 1;} while (0)
#define tmr3GetPR()				(PR3 + 1l)
#define tmr3Get()				(TMR3)
//activate the isr handler
void tmr3AttachISR(void (*isrptr)(void));

//initialize the timer4 (16bit)
void tmr4Init(uint8_t ps);
#define tmr4SetPS(ps)			T4CONbits.TCKPS = (ps)
#define tmr4GetPS()				((T4CONbits.TCKPS == 0)?1:((T4CONbits.TCKPS == 1)?8:((T4CONbits.TCKPS == 2)?64:256)))
#define tmr4SetPR(pr)			do {PR4 = (pr) - 1;} while (0)
#define tmr4GetPR()				(PR4 + 1l)
#define tmr4Get()				(TMR4)
//activate the isr handler
void tmr4AttachISR(void (*isrptr)(void));

//initialize the timer5 (16bit)
void tmr5Init(uint8_t ps);
#define tmr5SetPS(ps)			T5CONbits.TCKPS = (ps)
#define tmr5GetPS()				((T5CONbits.TCKPS == 0)?1:((T5CONbits.TCKPS == 1)?8:((T5CONbits.TCKPS == 2)?64:256)))
#define tmr5SetPR(pr)			do {PR5 = (pr) - 1;} while (0)
#define tmr5GetPR()				(PR5 + 1l)
#define tmr5Get()				(TMR5)
//activate the isr handler
void tmr5AttachISR(void (*isrptr)(void));

//32-bit timers
//initialize the timer23 (32bit)
void tmr23Init(uint8_t ps);
uint32_t tmr23Get(void);		//read 32-bit tmr23
#define tmr23SetPS(ps)			tmr2SetPS(ps)	//do {tmr2SetPS(ps); tmr3SetPS(ps)} while (0)
#define tmr23GetPS()			tmr2GetPS()
#define tmr23SetPR(pr)			do {PR3 = ((pr) - 1) >> 16; PR2 = (pr) - 1;} while (0)
#define tmr23GetPR()			((((uint32_t) PR3) << 16) | tmr2GetPR())
//activate the isr handler
#define tmr23AttachISR(isr)		tmr3AttachISR(isr)

