dannyf00/Ghetto-GPSDO/dspic33duino.h
//initialize the timer45 (32bit)
void tmr45Init(uint8_t ps);
uint32_t tmr45Get(void);		//read 32-bit tmr45
#define tmr45SetPS(ps)			tmr4SetPS(ps)	//do {tmr2SetPS(ps); tmr3SetPS(ps)} while (0)
#define tmr45GetPS()			tmr4GetPS()
#define tmr45SetPR(pr)			do {PR5 = ((pr) - 1) >> 16; PR4 = (pr) - 1;} while (0)
#define tmr45GetPR()			((((uint32_t) PR5) << 16) | tmr4GetPR())
//activate the isr handler
#define tmr45AttachISR(isr)		tmr5AttachISR(isr)

//pwm / oc
//initialize pwm1
void pwm1Init(void);
#define pwm1SetDC(dc)			do {OC1RS = (dc);} while (0)
#define pwm1GetDC()				(OC1RS)
#define pwm1SetPR(pr)			do {if (OC1CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm1GetPR()				((OC1CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm1SetPS(ps)			((OC1CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm1GetPS()				((OC1CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm2
void pwm2Init(void);
#define pwm2SetDC(dc)			do {OC2RS = (dc);} while (0)
#define pwm2GetDC()				(OC2RS)
#define pwm2SetPR(pr)			do {if (OC2CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm2GetPR()				((OC2CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm2SetPS(ps)			((OC2CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm2GetPS()				((OC2CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm3
void pwm3Init(void);
#define pwm3SetDC(dc)			do {OC3RS = (dc);} while (0)
#define pwm3GetDC()				(OC3RS)
#define pwm3SetPR(pr)			do {if (OC3CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm3GetPR()				((OC3CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm3SetPS(ps)			((OC3CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm3GetPS()				((OC3CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm4
void pwm4Init(void);
#define pwm4SetDC(dc)			do {OC4RS = (dc);} while (0)
#define pwm4GetDC()				(OC4RS)
#define pwm4SetPR(pr)			do {if (OC4CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm4GetPR()				((OC4CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm4SetPS(ps)			((OC4CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm4GetPS()				((OC4CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm5
void pwm5Init(void);
#define pwm5SetDC(dc)			do {OC5RS = (dc);} while (0)
#define pwm5GetDC()				(OC5RS)
#define pwm5SetPR(pr)			do {if (OC5CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm5GetPR()				((OC5CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm5SetPS(ps)			((OC5CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm5GetPS()				((OC5CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm6
void pwm6Init(void);
#define pwm6SetDC(dc)			do {OC6RS = (dc);} while (0)
#define pwm6GetDC()				(OC6RS)
#define pwm6SetPR(pr)			do {if (OC6CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm6GetPR()				((OC6CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm6SetPS(ps)			((OC6CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm6GetPS()				((OC6CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm7
void pwm7Init(void);
#define pwm7SetDC(dc)			do {OC7RS = (dc);} while (0)
#define pwm7GetDC()				(OC7RS)
#define pwm7SetPR(pr)			do {if (OC7CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm7GetPR()				((OC7CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm7SetPS(ps)			((OC7CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm7GetPS()				((OC7CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm8
void pwm8Init(void);
#define pwm8SetDC(dc)			do {OC8RS = (dc);} while (0)
#define pwm8GetDC()				(OC8RS)
#define pwm8SetPR(pr)			do {if (OC8CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm8GetPR()				((OC8CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm8SetPS(ps)			((OC8CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm8GetPS()				((OC8CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//initialize pwm9
void pwm9Init(void);
#define pwm9SetDC(dc)			do {OC9RS = (dc);} while (0)
#define pwm9GetDC()				(OC9RS)
#define pwm9SetPR(pr)			do {if (OC9CONbits.OCTSEL) PR3 = (pr) - 1; else PR2 = (pr) - 1;} while (0)
#define pwm9GetPR()				((OC9CONbits.OCTSEL)?tmr3GetPR():tmr2GetPR())
#define pwm9SetPS(ps)			((OC9CONbits.OCTSEL)?tmr3SetPS(ps):tmr2SetPS(ps))
#define pwm9GetPS()				((OC9CONbits.OCTSEL)?tmr3GetPS():tmr2GetPS())

//adc
//adc channels
#define ADC_AN0					(0)		//adc an0
#define ADC_AN1					(1)		//adc an1
#define ADC_AN2					(2)		//adc an2
#define ADC_AN3					(3)		//adc an3
#define ADC_AN4					(4)		//adc an4
#define ADC_AN5					(5)		//adc an5
#define ADC_AN6					(6)		//adc an6		-unimplemented on 28pin devices
#define ADC_AN7					(7)		//adc an7		-unimplemented on 28pin devices
#define ADC_AN8					(8)		//adc an8		-unimplemented on 28pin devices
#define ADC_AN9					(9)		//adc an9
#define ADC_AN10				(10)	//adc an10
#define ADC_AN11				(11)	//adc an11
#define ADC_AN12				(12)	//adc an12
//#define ADC_VCORE				(13)	//adc vcore
//#define ADC_VBG2				(14)	//adc bandgap/2
//#define ADC_VBG				(15)	//adc bandgap
//#define ADC_CTMU				(0xffff)	//for ctmu
#define ADC_ARAND				ADC_AN1	//the channel for random number generators
#define ADC_DLY					100		//cycle delay for adc
//rest the adc
//automatic sampling (ASAM=1), manual conversion
//12-bit adc, ch0 sample b only
void adcInit(void);

//read the adc
uint16_t analogRead(uint16_t ch);
//end ADC

//arand
//random number generators
#define arand1()			(analogRead(ADC_ARAND) & 0x01)	//generate 1-bit random number
uint8_t arand4(void);							//generate 4-bit random numbers
uint8_t arand8(void);							//generate 8-bit random numbers
uint16_t arand16(void);							//generate 16-bit random numbers
uint32_t arand32(void);							//generate 32-bit random numbers
//end arand

//output compare - TMR2 is the base
#define OC_TIMEBASE()			TMR2			//TMR2 as the timebase
void oc1Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc1AttachISR(void (*isrptr)(void));		//install user isr
void oc2Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc2AttachISR(void (*isrptr)(void));		//install user isr
void oc3Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc3AttachISR(void (*isrptr)(void));		//install user isr
void oc4Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc4AttachISR(void (*isrptr)(void));		//install user isr
void oc5Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc5AttachISR(void (*isrptr)(void));		//install user isr
void oc6Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc6AttachISR(void (*isrptr)(void));		//install user isr
void oc7Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc7AttachISR(void (*isrptr)(void));		//install user isr
void oc8Init(uint16_t pr);						//initialize oc1, by prescaler + period
void oc8AttachISR(void (*isrptr)(void));		//install user isr
//end output compare

//input capture
//16-bit mode, rising edge, single capture, Timer2 as timebase
#define IC_TIMEBASE()			TMR2			//TMR2 as the timebase
//interrupt disabled
void ic1Init(void);
void ic1AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic1Get()		IC1BUF					//read buffer value

