dannyf00/Ghetto-GPSDO/dspic33duino.h
void ic2Init(void);
void ic2AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic2Get()		IC2BUF					//read buffer value

void ic3Init(void);
void ic3AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic3Get()		IC3BUF					//read buffer value

void ic4Init(void);
void ic4AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic4Get()		IC4BUF					//read buffer value

void ic5Init(void);
void ic5AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic5Get()		IC5BUF					//read buffer value

void ic6Init(void);
void ic6AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic6Get()		IC6BUF					//read buffer value

void ic7Init(void);
void ic7AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic7Get()		IC7BUF					//read buffer value

void ic8Init(void);
void ic8AttachISR(void (*isrptr)(void));		//activate user ptr
#define ic8Get()		IC8BUF					//read buffer value

//end input capture

//extint
void int0Init(void);							//initialize the module
void int0AttachISR(void (*isrptr) (void));		//attach user isr

void int1Init(void);							//initialize the module
void int1AttachISR(void (*isrptr) (void));		//attach user isr

void int2Init(void);							//initialize the module
void int2AttachISR(void (*isrptr) (void));		//attach user isr

void int3Init(void);							//initialize the module
void int3AttachISR(void (*isrptr) (void));		//attach user isr

void int4Init(void);							//initialize the module
void int4AttachISR(void (*isrptr) (void));		//attach user isr
//end extint

//spi
void spi1Init(uint16_t br);						//reset the spi
#define spi1Busy()			(SPI1STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi1Available()		(!SPI1STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi1Write(dat)		SPI1BUF=(dat)		//send data via spi
#define spi1Read()			(SPI1BUF)			//read from the buffer

void spi2Init(uint16_t br);						//reset the spi
#define spi2Busy()			(SPI2STATbits.SPITBF)	//transmit buffer full, must wait before writing to SPIxBUF
#define spi2Available()		(!SPI2STATbits.SPIRBE)	//receive buffer not empty -> there is data
#define spi1Write(dat)		SPI1BUF=(dat)		//send data via spi
#define spi2Read()			(SPI2BUF)			//read from the buffer

//end spi

//i2c
//i2c commands
#define I2C_ACK				0							//0-> ack, to be consistent with i2c protocol
#define I2C_NOACK			1							//1-> no ack
#define I2C_CMD_READ		0x01						//i2c command for read
#define I2C_CMD_WRITE		0x00						//i2c command for write
#define I2C_ACK_ERROR		0x09						//max number of loops before ack times out

//#define F_I2C1			100000ul	//I2C frequency
void I2C1Init(uint32_t bps);			//initialize the i2c
void I2C1Start(void);					//send a start condition
void I2C1Stop(void);					//send a stop condition
void I2C1Restart(void);					//send a restart condition
//#define i2c1Wait()		do {while (I2C1CON & 0x1f); while (I2C1STATbits.TRSTAT);} while (0)		//wait for i2c
uint8_t I2C1Write(uint8_t dat);			//send i2c
uint8_t I2C1Read(uint8_t ack);			//read i2c
//write from a buffer
uint8_t I2C1Writes(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite);
//read to a buffer
uint8_t I2C1Reads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead);

//i2c2
//#define F_I2C2			100000ul		//I2C frequency
void I2C2Init(uint32_t bps);			//initialize the i2c
void I2C2Start(void);					//send a start condition
void I2C2Stop(void);					//send a stop condition
void I2C2Restart(void);					//send a restart condition
//#define i2c1Wait()		do {while (I2C2CON & 0x1f); while (I2C2STATbits.TRSTAT);} while (0)		//wait for i2c
uint8_t I2C2Write(uint8_t dat);			//send i2c
uint8_t I2C2Read(uint8_t ack);			//read i2c
//write from a buffer
uint8_t I2C2Writes(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite);
//read to a buffer
uint8_t I2C2Reads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead);
//end i2c

//end i2c

//software i2c
void sI2CInit(void);									//reset the software i2c
void sI2CStart(void);									//send a start condition
void sI2CStop(void);									//send a stop condition
uint8_t sI2CWrite(uint8_t dat);							//send a i2c byte
uint8_t sI2CRead(uint8_t ack);							//read i2c data
//write from a buffer
uint8_t sI2CWrites(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToWrite);
//read to a buffer
uint8_t sI2CReads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t *pBuffer, uint16_t NumByteToRead);
//end software i2c

//rtcc
//allows write to rtc registers
//#define RTCC_WREN()			do {NVMKEY=0x55; NVMKEY=0xaa; RCFGCALbits.RTCWREN = 1;} while (RCFGCALbits.RTCWREN == 0)
#define RTCC_WREN()	{	asm volatile("push w7"); \
						asm volatile("push w8"); \
						asm volatile("disi #5"); \
						asm volatile("mov #0x55, w7"); \
						asm volatile("mov w7, _NVMKEY"); \
						asm volatile("mov #0xAA, w8"); \
						asm volatile("mov w8, _NVMKEY"); \
						asm volatile("bset _RCFGCAL, #13"); \
						asm volatile("pop w8"); \
						asm volatile("pop w7"); \
					}
//do not allow any write to rtc registers - assumes the nvmkey sequence has been sent
#define RTCC_WRDIS()	do {RCFGCALbits.RTCWREN = 0;} while (RCFGCALbits.RTCWREN == 1)

//for RTCC PTR values to be used with RTCCRead() and RTCCWrite()
#define RTCPTR_MINSEC	0
#define RTCPTR_WKDHRS	1
#define RTCPTR_MONDAY	2
#define RTCPTR_YEAR		3

//bcd to dec conversion
#define BCD2DEC(bcd)				((((bcd) & 0xf0)>>4)*10+((bcd) & 0x0f))		//convert bcd to int
#define DEC2BCD(dec)				(((((dec) / 10)<<4) +((dec) % 10)) & 0xff)	//convert int to bcd

void RTCInit(void);							//initialize the rtcc
uint16_t RTCRead(uint16_t mask);				//read from rtcc, based on the value of mask (0..3)
#define RTCGetSec()				(RTCRead(RTCPTR_MINSEC) & 0xff)
#define RTCGetMin()				(RTCRead(RTCPTR_MINSEC) >> 8)
#define RTCGetHour()			(RTCRead(RTCPTR_WKDHRS) & 0xff)
#define RTCGetWDay()			(RTCRead(RTCPTR_WKDHRS) >> 8)
#define RTCGetDay()				(RTCRead(RTCPTR_MONDAY) & 0xff)
#define RTCGetMonth()			(RTCRead(RTCPTR_MONDAY) >> 8)
#define RTCGetYear()			(RTCRead(RTCPTR_YEAR  ) & 0xff)
void RTCWrite(uint16_t mask, uint16_t byte_t);	//write to rtcc,  based on the value of mask (0..3)
#define RTCSetSec(dat)			RTCWrite(RTCPTR_MINSEC, (RTCRead(RTCPTR_MINSEC) & ~0x00ff) | ((dat) & 0x00ff))
#define RTCSetMin(dat)			RTCWrite(RTCPTR_MINSEC, (RTCRead(RTCPTR_MINSEC) & ~0xff00) | ((dat) & 0xff00))
#define RTCSetHour(dat)			RTCWrite(RTCPTR_WKDHRS, (RTCRead(RTCPTR_WKDHRS) & ~0x00ff) | ((dat) & 0x00ff))
#define RTCSetWDay(dat)			RTCWrite(RTCPTR_WKDHRS, (RTCRead(RTCPTR_WKDHRS) & ~0xff00) | ((dat) & 0xff00))
#define RTCSetDay(dat)			RTCWrite(RTCPTR_MONDAY, (RTCRead(RTCPTR_MONDAY) & ~0x00ff) | ((dat) & 0x00ff))
#define RTCSetMonth(dat)		RTCWrite(RTCPTR_MONDAY, (RTCRead(RTCPTR_MONDAY) & ~0xff00) | ((dat) & 0xff00))
#define RTCSetYear(dat)			RTCWrite(RTCPTR_YEAR,   (RTCRead(RTCPTR_YEAR  ) & ~0x00ff) | ((dat) & 0x00ff))
 int8_t RTCSetCal(int8_t cal); 	//write to rtcc calibration register, -512 .. +508 RTC pulses every minute, +/- 260ppm adjustment range, 2ppm/step
//uint8_t RTCGetCal(void);		//read from rtcc calibration register
#define RTCGetCal()				((int8_t) RCFGCALbits.CAL=cal)
void RTCAttachISR(void (*isrptr)(void));		//attach rtc isr
time_t RTC2time(time_t *t);						//read rtcc time into time_t
time_t time2RTC(time_t t);						//turn mktime (=time_t) to RTCC
#define RTCHalfsec()			(RCFGCALbits.HALFSEC)	//half sec: 0->first half sec and 1->second half sec
//end rtc

