dannyf00/Ghetto-GPSDO/dspic33duino.h
//software RTC
//global defines

//global variables
typedef struct {
	time_t time;						//second counter since 1/1/1970
	uint32_t tick;						//tick counter
	int16_t cal;						//rtc calibration, in ppm. +=faster, -=slower
	uint8_t halfsec;					//0=first half sec, 1=2nd half sec
} sRTC_TypeDef;

void sRTCInit(void);					//initialize software counter //calibration from -128ppm to +128ppm, if sRTC_RATE = 1M
void sRTCSetCal(int16_t cal);			//set sRTC calibration
void sRTCISR(void);						//increment -> called sRTC_CALLRATE times per second
#define sRTCUpdate()	sRTCISR()		//for compatability
uint32_t sRTCTick(void);				//read rtc tick
time_t sRTC2time(time_t *t);			//read sRTC second counter
time_t time2sRTC(time_t t);				//set sRTC second counter
uint8_t sRTCHalfsec(void);				//return 0: first half of a sec, 1: 2nd half of a sec
#define sRTCGetSec()		(sRTC2time(NULL) % 60)		//for compatability
//end software RTC
//cnint
void cnInit(uint32_t pins);						//initialize change notification
void cnAttachISR(void (*isrptr) (void));		//attach user isr
//end cnint

//crc
void CRCInit(uint8_t len, uint32_t poly);							//initialize the crc
uint16_t CRC16(char *msg, uint16_t length, uint16_t init_val);		//return crc check on a message. length must be multiples of 2
#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)
#define CRCBusy()				(CRCCON1bits.CRCGO == 1)			////if CRC is busy
#define CRCAvailable()		(CRCCON1bits.CRCGO == 0)			//crc complete, data available
#else
#define CRCBusy()				(CRCCONbits.CRCGO == 1)			////if CRC is busy
#define CRCAvailable()		(CRCCONbits.CRCGO == 0)			//crc complete, data available
#endif
#define CRCGet()				(CRCWDAT)							//read CRC back
#define CRC8Init(xor, init)		CRCInit(0x07, xor, init)			//initialize 16-bit CRC
#define CRC16Init(xor, init)	CRCInit(0x0f, xor, init)			//initialize 16-bit CRC
#define CRC32Init(xor, init)	CRCInit(0x1f, x0r, init)			//initialize 32-bit CRC
//end crc

//comparator voltage reference
//comparator voltage reference
void CVrefInit(void);
#define CVrefSet(range)			CVRCONbits.CVR=(range)			//set output range
#define CVrefGet()				(CVRCONbits.CVR)				//return output range
#define CVrefOE()				CVRCONbits.CVROE=1				//0->disable output, 1->enable output
#define CVrefOD()				CVRCONbits.CVROE=0				//0->disable output, 1->enable output

//comparator
#if 	defined(__PIC24FJ64GA102__) | defined (__PIC24FJ64GA104__) | \
		defined(__PIC24FJ32GA102__) | defined (__PIC24FJ32GA104__)

void CM1Init(void);				//initialize comparator
#define CM1OUT()				(CM1CONbits.COUT)				//output status
#define CM1INA()				CM1CONbits.CREF=0				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM1CVrefp()				CM1CONbits.CREF=1				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM1INB()				CM1CONbits.CCH =0				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM1INC()				CM1CONbits.CCH =1				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM1IND()				CM1CONbits.CCH =2				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM1CVrefn()				CM1CONbits.CCH =3				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM1OE()					CM1CONbits.COE =1				//1->enable output, 0->disable output
#define CM1OD()					CM1CONbits.COE =0				//1->enable output, 0->disable output

void CM2Init(void);				//initialize comparator
#define CM2OUT()				(CM2CONbits.COUT)				//output status
#define CM2INA()				CM2CONbits.CREF=0				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM2CVrefp()				CM2CONbits.CREF=1				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM2INB()				CM2CONbits.CCH =0				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM2INC()				CM2CONbits.CCH =1				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM2IND()				CM2CONbits.CCH =2				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM2CVrefn()				CM2CONbits.CCH =3				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM2OE()					CM2CONbits.COE =1				//1->enable output, 0->disable output
#define CM2OD()					CM2CONbits.COE =0				//1->enable output, 0->disable output

void CM3Init(void);				//initialize comparator
#define CM3OUT()				(CM3CONbits.COUT)				//output status
#define CM3INA()				CM3CONbits.CREF=0				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM3CVrefp()				CM3CONbits.CREF=1				//0->non-inventing input to CxINA, 1->non-inventing input to CVref+
#define CM3INB()				CM3CONbits.CCH =0				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM3INC()				CM3CONbits.CCH =1				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM3IND()				CM3CONbits.CCH =2				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM3CVrefn()				CM3CONbits.CCH =3				//0->inventing input to CxINB, 1->to CxINC, 2->to CxIND, 3->to CVref-
#define CM3OE()					CM3CONbits.COE =1				//1->enable output, 0->disable output
#define CM3OD()					CM3CONbits.COE =0				//1->enable output, 0->disable output

#else		//ga002 chips

void CM1Init(void);				//initialize comparator
#define CM1OUT()				(CMCONbits.C1OUT)				//output status
#define CM1NVinp()				CMCONbits.C1NEG=1				//1->C1NEG to Vin+, 0->C1NEG to Vin-
#define CM1NVinn()				CMCONbits.C1NEG=0				//1->C1NEG to Vin+, 0->C1NEG to Vin-
#define CM1PVinp()				CMCONbits.C1POS=1				//1->C1POS to Vin+, 0->C1NEG to CVref
#define CM1PCVref()				CMCONbits.C1POS=0				//1->C1POS to Vin+, 0->C1NEG to CVref
#define CM1OE()					CMCONbits.C1OUTEN =1			//1->enable output, 0->disable output
#define CM1OD()					CMCONbits.C1OUTEN =0			//1->enable output, 0->disable output

void CM2Init(void);				//initialize comparator
#define CM2OUT()				(CMCONbits.C2OUT)				//output status
#define CM2NVinp()				CMCONbits.C2NEG=1				//1->C1NEG to Vin+, 0->C1NEG to Vin-
#define CM2NVinn()				CMCONbits.C2NEG=0				//1->C1NEG to Vin+, 0->C1NEG to Vin-
#define CM2PVinp()				CMCONbits.C2POS=1				//1->C1POS to Vin+, 0->C1NEG to CVref
#define CM2PCVref()				CMCONbits.C2POS=0				//1->C1POS to Vin+, 0->C1NEG to CVref
#define CM2OE()					CMCONbits.C2OUTEN =1			//1->enable output, 0->disable output
#define CM2OD()					CMCONbits.C2OUTEN =0			//1->enable output, 0->disable output

#endif		//comparator

//circular buffer
//circular buffer to store char
typedef struct {
	cbuffer_t buffer[cBUFF_SIZE];		//buffer
	uint16_t writeIndex;					//index for the current write-> advance first and then write
	uint16_t readIndex;					//index for the current read -> advance first and then read
} CB_TypeDef;

void cbInit(CB_TypeDef *cbuffer);		//reset the cbuffer
char cbEmpty(CB_TypeDef *cbuffer);		//returns true if cbuffer is empty
char cbFull(CB_TypeDef *cbuffer);		//returns true if cbuffer is full;
cbuffer_t cbWrite(CB_TypeDef *cbuffer, cbuffer_t dat);	//write to the buffer - needs to test if the buffer is full first
cbuffer_t cbRead(CB_TypeDef *cbuffer);	//read from the buffer - needs to test if the buffer is empty
void str2cb(CB_TypeDef *cb, char *str);	//write string to CB
void cb2str(char *str, CB_TypeDef *cb);	//write CB to string
//end circular buffer


//dac1
//initialize dac1
//dac1xM output disabled
//input data = unsigned format
//len=0: disable left channel, 1: enable left channel
//ren=0: disable right channel,1: enable right channel
void dac1Init(char len, char ren);
//output data on left/right channel
#define dac1Lout(dat)		DAC1LDAT = (dat)				//output on DAC1LP/N pins
#define dac1Rout(dat)		DAC1RDAT = (dat)				//output on DAC1RP/N pins
//end dac1

//crc
//programmable crc
//initialize crc
void crcInit(uint16_t poly, uint8_t plen);
#define crcWrite(dat)	do {while (CRCCONbits.CRCFUL) continue; CRCDAT = (dat); CRCCONbits.CRCGO = 1;} while (0)
#define crcRead()		(CRCWDAT)//end crc

#endif		//pic24duino
